#include "DayFoodIntake.h"


//ћетод получени€ данных

void DayFoodIntake::EnteringData()
{
	bool checking = true;
	do {
		cout << "------------------------------------------------------------------" << endl;
		cout << "|¬ведите массу продукта в граммах                                |" << endl;
		cout << "------------------------------------------------------------------" << endl;
		if ((cin >> massG).good() && massG > 0) {
			checking = false;
		}
		if (cin.fail() || massG <= 0)
		{
			cin.clear();
			cout << "------------------------------------------------------------------" << endl;
			cout << "|ќЎ»Ѕ ј!!! ¬ведите корректные данные!                            |" << endl;
			cout << "------------------------------------------------------------------" << endl;
		}
		cin.ignore(100, '\n');

	} while (checking);

	for (int i = 0; i < countIntake; i++)
	{
		bool check = true;
		do {
			cout << "------------------------------------------------------------------" << endl;
			cout << "|¬ведите количество белков (на 100г продукта) за " << i + 1 << " приЄм пищи    |" << endl;
			cout << "------------------------------------------------------------------" << endl;

			if ((cin >> dynamincProteinArray[i]).good())
			{
				volumeCcal += dynamincProteinArray[i] * PROTEIN_CCAL_1G;
				check = false;
			}
			if (cin.fail())
			{
				cin.clear();
				cout << "------------------------------------------------------------------" << endl;
				cout << "|ќЎ»Ѕ ј!!! ¬ведите корректные данные!                            |" << endl;
				cout << "------------------------------------------------------------------" << endl;
			}
			cin.ignore(100, '\n');

		} while (check);
	}

	for (int i = 0; i < countIntake; i++)
	{
		bool check = true;
		do {
			cout << "------------------------------------------------------------------" << endl;
			cout << "|¬ведите количество жиров (на 100г продукта) за " << i + 1 << " приЄм пищи     |" << endl;
			cout << "------------------------------------------------------------------" << endl;
			if ((cin >> dynamincFatArray[i]).good())
			{
				volumeCcal += dynamincFatArray[i] * FAT_CCAL_1G;
				check = false;
			}
			if (cin.fail())
			{
				cin.clear();
				cout << "------------------------------------------------------------------" << endl;
				cout << "|ќЎ»Ѕ ј!!! ¬ведите корректные данные!                            |" << endl;
				cout << "------------------------------------------------------------------" << endl;
			}
			cin.ignore(100, '\n');

		} while (check);
	}

	for (int i = 0; i < countIntake; i++)
	{
		bool check = true;
		do {
			cout << "------------------------------------------------------------------" << endl;
			cout << "|¬ведите количество углеводов (на 100г продукта) за " << i + 1 << " приЄм пищи |" << endl;
			cout << "------------------------------------------------------------------" << endl;
			if ((cin >> dynamincCarbohydrateArray[i]).good())
			{
				volumeCcal += dynamincCarbohydrateArray[i] * CARBOHYDRATE_CCAL_1G;
				check = false;
			}
			if (cin.fail())
			{
				cin.clear();
				cout << "------------------------------------------------------------------" << endl;
				cout << "|ќЎ»Ѕ ј!!! ¬ведите корректные данные!                            |" << endl;
				cout << "------------------------------------------------------------------" << endl;
			}
			cin.ignore(100, '\n');

		} while (check);
	}

}

void DayFoodIntake::OutputData()
{
	cout << "------------------------------------------------------------------" << endl;
	cout << "|ќбщее количество каллорий                                       |" << volumeCcal << endl;
	cout << "------------------------------------------------------------------" << endl;

}
